#T14_10_wordguess.py
#Р’С–РґРіР°РґСѓРІР°РЅРЅСЏ СЃР»С–РІ Р· РІРёРєРѕСЂРёСЃС‚Р°РЅРЅСЏРј РґРµРєСѓ

from collections import deque
import random
import os

#T14s2_11
#РљС–Р»СЊС†РµРІРёР№ СЃРїРёСЃРѕРє

class Rlist:
    '''Р РµР°Р»С–Р·СѓС” РєС–Р»СЊС†РµРІРёР№ СЃРїРёСЃРѕРє РЅР° Р±Р°Р·С– СЃРїРёСЃРєСѓ.
    '''
    def __init__(self):
        '''РЎС‚РІРѕСЂРёС‚Рё РїРѕСЂРѕР¶РЅС–Р№ СЃРїРёСЃРѕРє.
        '''
        self._lst = []                  #СЃРїРёСЃРѕРє РµР»РµРјРµРЅС‚С–РІ
        self._cur = None                #С–РЅРґРµРєСЃ РїРѕС‚РѕС‡РЅРѕРіРѕ РµР»РµРјРµРЅС‚Р°

    def len(self):
        '''Р”РѕРІР¶РёРЅР° СЃРїРёСЃРєСѓ.
        '''
        return len(self._lst)

    def next(self):
        '''РџРµСЂРµР№С‚Рё РґРѕ РЅР°СЃС‚СѓРїРЅРѕРіРѕ РµР»РµРјРµРЅС‚Р°.
        '''
        l = self.len()
        if l != 0:
            if self._cur == l-1:    #РґР»СЏ (l-1) РµР»РµРјРµРЅС‚Р° РЅР°СЃС‚СѓРїРЅРёРј Р±СѓРґРµ РЅСѓР»СЊРѕРІРёР№
                self._cur = 0
            else:
                self._cur += 1

    def getcurrent(self):
        '''РџРѕРІРµСЂРЅСѓС‚Рё РїРѕС‚РѕС‡РЅРёР№ РµР»РµРјРµРЅС‚.
        '''
        if self.len() == 0:
            print('getcurrent: СЃРїРёСЃРѕРє РїРѕСЂРѕР¶РЅС–Р№')
            exit(1)
        data = self._lst[self._cur]
        return data

    def update(self, data):
        '''РћРЅРѕРІРёС‚Рё РїРѕС‚РѕС‡РЅРёР№ РµР»РµРјРµРЅС‚.
        '''
        if self.len() == 0:
            print('update: СЃРїРёСЃРѕРє РїРѕСЂРѕР¶РЅС–Р№')
            exit(1)
        self._lst[self._cur] = data

    def insert(self, data):
        '''Р’СЃС‚Р°РІРёС‚Рё РµР»РµРјРµРЅС‚ РїРµСЂРµРґ РїРѕС‚РѕС‡РЅРёРј.
        '''
        if self.len() == 0:             #СЏРєС‰Рѕ СЃРїРёСЃРѕРє РїРѕСЂРѕР¶РЅС–Р№
            self._lst.append(data)      #РґРѕРґР°С”РјРѕ РµР»РµРјРµРЅС‚, РІС–РЅ СЃС‚Р°С” РїРѕС‚РѕС‡РЅРёРј
            self._cur = 0
        else:
            self._lst.insert(self._cur,data) #С–РЅР°РєС€Рµ РІСЃС‚Р°РІР»СЏС”РјРѕ РµР»РµРјРµРЅС‚ РїРµСЂРµРґ РїРѕС‚РѕС‡РЅРёРј
            self._cur += 1                   #С‰РѕР± РїРѕС‚РѕС‡РЅРёР№ РµР»РµРјРµРЅС‚ РЅРµ Р·РјС–РЅРёРІСЃСЏ, С‚СЂРµР±Р° С–РЅРґРµРєСЃ Р·Р±С–Р»СЊС€РёС‚Рё РЅР° 1

    def delete(self):
        '''Р’РёРґР°Р»РёС‚Рё РїРѕС‚РѕС‡РЅРёР№ РµР»РµРјРµРЅС‚.
        '''
        if self.len() == 0:
            print('delete: СЃРїРёСЃРѕРє РїРѕСЂРѕР¶РЅС–Р№')
            exit(1)
        l = self.len()
        del self._lst[self._cur]
        if l == 1:                  #СЏРєС‰Рѕ СЃРїРёСЃРѕРє РїС–СЃР»СЏ РІРёРґР°Р»РµРЅРЅСЏ РµР»РµРјРµРЅС‚Р° СЃРїРѕСЂРѕР¶РЅС–С”
            self._cur = None
        elif self._cur == l-1:      #СЏРєС‰Рѕ РїРѕС‚РѕС‡РЅРёРј Р±СѓРІ РѕСЃС‚Р°РЅРЅС–Р№ РµР»РµРјРµРЅС‚ СЃРїРёСЃРєСѓ
            self._cur = 0           #РїРѕС‚РѕС‡РЅРёРј СЃС‚Р°РЅРµ РµР»РµРјРµРЅС‚ Р· С–РЅРґРµРєСЃРѕРј 0
        #else: pass                  СЏРєС‰Рѕ РїРѕС‚РѕС‡РЅРёРј Р±СѓРІ РЅРµ РѕСЃС‚Р°РЅРЅС–Р№ РµР»РµРјРµРЅС‚, РЅС–С‡РѕРіРѕ РЅРµ СЂРѕР±РёС‚Рё

    def __del__(self):
        '''Р—Р°РєС–РЅС‡РёС‚Рё СЂРѕР±РѕС‚Сѓ Р·С– СЃРїРёСЃРєРѕРј.
        '''
        del self._lst

word = ""           #СЃР»РѕРІРѕ, С‰Рѕ С‚СЂРµР±Р° РІС–РґРіР°РґР°С‚Рё
guessed = ""        #СЃР»РѕРІРѕ РґР»СЏ РїРѕРєР°Р·Сѓ (СЃРїРѕС‡Р°С‚РєСѓ - '*')
guessers = deque()     #СЃРїРёСЃРѕРє РіСЂР°РІС†С–РІ
gameover = False       #РѕР·РЅР°РєР° Р·Р°РІРµСЂС€РµРЅРЅСЏ РіСЂРё
filename = 'text.txt'  #С„Р°Р№Р» Р·С– СЃР»РѕРІР°РјРё


class Guesser:
    '''РљР»Р°СЃ РІС–РґРіР°РґСѓРІР°С‡
    '''
    def __init__(self, name):
        self._name = name           #С–Рј"СЏ
        self._points = 0            #Р±Р°Р»Рё

    def show(self):
        '''РџРѕРєР°Р·Р°С‚Рё СЂРµР·СѓР»СЊС‚Р°С‚.
        '''
        print(self._name, self._points)

    def inc(self, points):
        '''Р—Р±С–Р»СЊС€РёС‚Рё РєС–Р»СЊРєС–СЃС‚СЊ Р±Р°Р»С–РІ РЅР° points.
        '''
        self._points += points

    def clear(self):
        '''РћС‡РёСЃС‚РёС‚Рё Р±Р°Р»Рё.
        '''
        self._points = 0

    def getname(self):
        '''РџРѕРІРµСЂРЅСѓС‚Рё С–Рј"СЏ РіСЂР°РІС†СЏ.
        '''
        return self._name

def del_term (s, t):
    '''Р’РёРґР°Р»СЏС” Р· s СѓСЃС– СЃРёРјРІРѕР»Рё-СЂРѕР·РґС–Р»СЋРІР°С‡С–, СЏРєС– С” Сѓ СЂСЏРґРєСѓ t.

    '''
    for c in t:
        s = s.replace(c,"")
    return s

def prepare_string (s):
    '''Р“РѕС‚СѓС” СЂСЏРґРѕРє s РґРѕ РіРµРЅРµСЂР°С†С–С— СЃР»С–РІ.

    Р’РёРґР°Р»СЏС” Р· s СѓСЃС– СЃРёРјРІРѕР»Рё-СЂРѕР·РґС–Р»СЋРІР°С‡С– С‚Р° РїРµСЂРµРІРѕРґРёС‚СЊ СЂСЏРґРѕРє РґРѕ РЅРёР¶РЅСЊРѕРіРѕ СЂРµРіС–СЃС‚СЂСѓ.
    '''
    r = del_term(s, '()0123456789,.!?:;-"вЂ™\n')
    return r.lower()

def makeword(filename):
    '''Р‘СѓРґСѓС” СЃР»РѕРІРѕ РґР»СЏ РІС–РґРіР°РґСѓРІР°РЅРЅСЏ word Р° С‚Р°РєРѕР¶ СЃР»РѕРІРѕ guessed Р· '*' С‚Р°РєРѕС— Р¶ РґРѕРІР¶РёРЅРё.

    '''
    global word, guessed
    f = open(filename, encoding='windows-1251')
    offs = random.randrange(os.path.getsize(filename)) #Р·РЅР°С…РѕРґРёРјРѕ РІРёРїР°РґРєРѕРІРµ РјС–СЃС†Рµ Сѓ С„Р°Р№Р»С–
    f.seek(offs)
    words = []
    for i in range(10):                                 #С‡РёС‚Р°С”РјРѕ 10 СЂСЏРґРєС–РІ
        s = f.readline()
        s = prepare_string(s)
        words += s.split()      #Р±СѓРґСѓС”РјРѕ СЃРїРёСЃРѕРє СЃР»С–РІ
    del words[0]                #РїРµСЂС€Рµ СЃР»РѕРІРѕ РјРѕР¶Рµ Р±СѓС‚Рё РЅРµРїРѕРІРЅРёРј, РІРёРґР°Р»СЏС”РјРѕ Р№РѕРіРѕ
    f.close()
    words = [w for w in words if len(w) >= 3] # СѓСЃС– СЃР»РѕРІР° РґРѕРІР¶РёРЅРѕСЋ РЅРµ РјРµРЅС€Рµ 3
#    print(words)
#    s = "Р·РІ'СЏР·СѓРІР°РЅРЅСЏ РјС–Р¶ РѕР±'С”РєС‚Р°РјРё С‚Р° РјРµС‚РѕРґР°РјРё РїРѕРЅСЏС‚С‚СЏ РІС–СЂС‚СѓР°Р»СЊРЅРёС… РјРµС‚РѕРґС–РІ РїРѕР»С–РјРѕСЂС„С–Р·Рј"
#    words = s.split()
    i = random.randrange(len(words))    #РІРёР±РёСЂР°С”РјРѕ РІРёРїР°РґРєРѕРІРµ СЃР»РѕРІРѕ Р·С– СЃРїРёСЃРєСѓ
    word = words[i]
#    print(word)
    guessed = "*"*len(word)     #Р·Р°РїРѕРІРЅСЋС”РјРѕ СЃР»РѕРІРѕ РґР»СЏ РІС–РґРіР°РґСѓРІР°РЅРЅСЏ *
    return word, guessed


def inputguessers(guessers):
    '''Р’РІРѕРґРёС‚СЊ РіСЂР°РІС†С–РІ С‚Р° Р·Р°РїРёСЃСѓС” С—С… Сѓ РґРµРє guessers.

    '''
    print('Р’РІРµРґС–С‚СЊ РїСЂС–Р·РІРёС‰Р° РіСЂР°РІС†С–РІ. "" - Р·Р°РІРµСЂС€РµРЅРЅСЏ')
    while True:
        name = input('?')
        if len(name) == 0: break
        g = Guesser(name)           #СЃС‚РІРѕСЂРёС‚Рё РіСЂР°РІС†СЏ
        guessers.append(g)          #С‚Р° РґРѕРґР°С‚Рё РґРѕ РґРµРєСѓ

def guess():
    '''Р’РёРєРѕРЅСѓС” 1 СЃРїСЂРѕР±Сѓ РІРіР°РґР°С‚Рё.

    '''
    global word, guessed, gameover
    while True:
        m = input("1 - Р»С–С‚РµСЂР°, 2 - СЃР»РѕРІРѕ: ")
        if m in {"1", "2"}: break
    if m == '1':                              #Р»С–С‚РµСЂР°
        while True:
            c = input('Р»С–С‚РµСЂР°: ')
            if not c in guessed: break
            print(c,' - РІР¶Рµ РІС–РґРіР°РґР°РЅРѕ. Р’РІРµРґС–С‚СЊ С–РЅС€Сѓ Р»С–С‚РµСЂСѓ')
        points = 0
        gw = ""
        for i in range(len(word)):  #Р·Р°РјС–РЅСЋС”РјРѕ Сѓ guessed РІСЃС– '*" Сѓ РјС–СЃС†СЏС… РІС…РѕРґР¶РµРЅРЅСЏ c РґРѕ word РЅР° СЃ
            if word[i] == c:
                gw = gw + c         #РґРѕРїРёСЃСѓС”РјРѕ СЃРёРјРІРѕР» c РґРѕ СЃР»РѕРІР° РІС–РґРіР°РґСѓРІР°РЅРЅСЏ
                points += 1         #Р·Р±С–Р»СЊС€СѓС”РјРѕ Р±Р°Р»Рё РЅР° 1
            else:
                gw = gw + guessed[i]#РґРѕРїРёСЃСѓС”РјРѕ С‚РѕР№ СЃРёРјРІРѕР» СЏРєРёР№ Р±СѓРІ Сѓ guessed
        guessed = gw
    else:                                   #СЃР»РѕРІРѕ
        w = input('СЃР»РѕРІРѕ: ')
        if w == word:               #СЃР»РѕРІРѕ РІС–РґРіР°РґР°РЅРѕ
            points = guessed.count('*') #РґРѕРґР°С”РјРѕ Р±Р°Р»С–РІ СЃС‚С–Р»СЊРєРё, СЃРєС–Р»СЊРєРё Р±СѓР»Рѕ *
            guessed = word
        else:                       #СЃР»РѕРІРѕ РЅРµ РІС–РґРіР°РґР°РЅРѕ
            points = -1             #-1 РѕР·РЅР°С‡Р°С”, С‰Рѕ С‚СЂРµР±Р° РѕС‡РёСЃС‚РёС‚Рё РІСЃС– Р±Р°Р»Рё
    gameover = not '*' in guessed   #РіСЂСѓ Р·Р°РєС–РЅС‡РµРЅРѕ, СЏРєС‰Рѕ Сѓ СЃР»РѕРІС– РЅРµ Р·Р°Р»РёС€РёР»РѕСЃСЊ *
    return points

def showguessers(guessers):
    '''РџРѕРєР°Р·СѓС” РіСЂР°РІС†С–РІ С‚Р° С—С… Р±Р°Р»Рё.

    '''
    for i in range(len(guessers)):
        g = guessers[0]       #РѕС‚СЂРёРјР°С‚Рё Р· РґРµРєСѓ РїРѕС‚РѕС‡РЅРѕРіРѕ РіСЂР°РІС†СЏ
        g.show()              #РїРѕРєР°Р·Р°С‚Рё Р№РѕРіРѕ РґР°РЅС–
        guessers.rotate(-1)   #РїРµСЂРµР№С‚Рё РґРѕ РЅР°СЃС‚СѓРїРЅРѕРіРѕ РіСЂР°РІС†СЏ

def play(guessers):
    '''РџС–РґС‚СЂРёРјСѓС” РіСЂСѓ РґР»СЏ РѕРґРЅРѕРіРѕ СЃР»РѕРІР°.

    '''
    global guessed, gameover
    print('РџРѕС‡РёРЅР°С”РјРѕ РІС–РґРіР°РґСѓРІР°С‚Рё')
    gameover = False
    while not gameover:
        while True:
            print(guessed)         # РїРѕРєР°Р·Р°С‚Рё РїРѕС‚РѕС‡РЅРёР№ СЃС‚Р°РЅ СЃР»РѕРІР° РґР»СЏ РІС–РґРіР°РґСѓРІР°РЅРЅСЏ
            g = guessers.popleft() # РІРёР±СЂР°С‚Рё РіСЂР°РІС†СЏ Р· РїРѕС‡Р°С‚РєСѓ РґРµРєСѓ
            print('Р’Р°С€ С…С–Рґ,', g.getname())
            points = guess()
            if points > 0:
                g.inc(points)
                print('Р’Рё Р·Р°СЂРѕР±РёР»Рё Р±Р°Р»С–РІ:', points)
                if gameover:
                    print('Р’С–С‚Р°С”РјРѕ! Р’Рё РІРёРіСЂР°Р»Рё!!!')
                    g.inc(len(word))    # РїСЂРµРјС–СЏ Р·Р° РІС–РґРіР°РґСѓРІР°РЅРЅСЏ СЃР»РѕРІР°
            elif points < 0:
                print('РќР° Р¶Р°Р»СЊ, Р’Р°С€С– Р±Р°Р»Рё "Р·РіРѕСЂС–Р»Рё"')
                g.clear()
            else:                       # points == 0
                print('РќРµРјР°С” С‚Р°РєРѕС— Р»С–С‚РµСЂРё')
            guessers.appendleft(g)  # РґРѕРґР°С‚Рё РіСЂР°РІС†СЏ РґРѕ РїРѕС‡Р°С‚РєСѓ РґРµРєСѓ
            if gameover or points <= 0: break
        guessers.rotate(-1)             # РїРµСЂРµР№С‚Рё РґРѕ РЅР°СЃС‚СѓРїРЅРѕРіРѕ РіСЂР°РІС†СЏ
    print('РЎР»РѕРІРѕ - ', word)

if __name__ == '__main__':
    makeword(filename)
    inputguessers(guessers)
    play(guessers)
    print('Р РµР·СѓР»СЊС‚Р°С‚Рё')
    showguessers(guessers)
